node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "global_step/read"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Assign"
  op: "Assign"
  input: "global_step"
  input: "add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "is_training"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4725
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 4725
          }
        }
        string_val: "../data/Training/Run_0001/images/frame_04058.png"
        string_val: "../data/Training/Run_0001/images/frame_00670.png"
        string_val: "../data/Training/Run_0001/images/frame_04071.png"
        string_val: "../data/Training/Run_0001/images/frame_04004.png"
        string_val: "../data/Training/Run_0001/images/frame_02895.png"
        string_val: "../data/Training/Run_0001/images/frame_03970.png"
        string_val: "../data/Training/Run_0001/images/frame_02194.png"
        string_val: "../data/Training/Run_0001/images/frame_01597.png"
        string_val: "../data/Training/Run_0001/images/frame_02692.png"
        string_val: "../data/Training/Run_0001/images/frame_00023.png"
        string_val: "../data/Training/Run_0001/images/frame_03768.png"
        string_val: "../data/Training/Run_0001/images/frame_01661.png"
        string_val: "../data/Training/Run_0001/images/frame_00613.png"
        string_val: "../data/Training/Run_0001/images/frame_03709.png"
        string_val: "../data/Training/Run_0001/images/frame_04540.png"
        string_val: "../data/Training/Run_0001/images/frame_02267.png"
        string_val: "../data/Training/Run_0001/images/frame_04376.png"
        string_val: "../data/Training/Run_0001/images/frame_03553.png"
        string_val: "../data/Training/Run_0001/images/frame_03130.png"
        string_val: "../data/Training/Run_0001/images/frame_02824.png"
        string_val: "../data/Training/Run_0001/images/frame_01006.png"
        string_val: "../data/Training/Run_0001/images/frame_04012.png"
        string_val: "../data/Training/Run_0001/images/frame_02460.png"
        string_val: "../data/Training/Run_0001/images/frame_02380.png"
        string_val: "../data/Training/Run_0001/images/frame_04039.png"
        string_val: "../data/Training/Run_0001/images/frame_04034.png"
        string_val: "../data/Training/Run_0001/images/frame_01796.png"
        string_val: "../data/Training/Run_0001/images/frame_02044.png"
        string_val: "../data/Training/Run_0001/images/frame_02443.png"
        string_val: "../data/Training/Run_0001/images/frame_01203.png"
        string_val: "../data/Training/Run_0001/images/frame_04667.png"
        string_val: "../data/Training/Run_0001/images/frame_00921.png"
        string_val: "../data/Training/Run_0001/images/frame_01379.png"
        string_val: "../data/Training/Run_0001/images/frame_03190.png"
        string_val: "../data/Training/Run_0001/images/frame_01647.png"
        string_val: "../data/Training/Run_0001/images/frame_01968.png"
        string_val: "../data/Training/Run_0001/images/frame_01108.png"
        string_val: "../data/Training/Run_0001/images/frame_01537.png"
        string_val: "../data/Training/Run_0001/images/frame_00404.png"
        string_val: "../data/Training/Run_0001/images/frame_01276.png"
        string_val: "../data/Training/Run_0001/images/frame_04275.png"
        string_val: "../data/Training/Run_0001/images/frame_01463.png"
        string_val: "../data/Training/Run_0001/images/frame_03208.png"
        string_val: "../data/Training/Run_0001/images/frame_04429.png"
        string_val: "../data/Training/Run_0001/images/frame_04293.png"
        string_val: "../data/Training/Run_0001/images/frame_02876.png"
        string_val: "../data/Training/Run_0001/images/frame_02783.png"
        string_val: "../data/Training/Run_0001/images/frame_00861.png"
        string_val: "../data/Training/Run_0001/images/frame_00274.png"
        string_val: "../data/Training/Run_0001/images/frame_01002.png"
        string_val: "../data/Training/Run_0001/images/frame_01836.png"
        string_val: "../data/Training/Run_0001/images/frame_00080.png"
        string_val: "../data/Training/Run_0001/images/frame_00554.png"
        string_val: "../data/Training/Run_0001/images/frame_02753.png"
        string_val: "../data/Training/Run_0001/images/frame_04544.png"
        string_val: "../data/Training/Run_0001/images/frame_01927.png"
        string_val: "../data/Training/Run_0001/images/frame_04683.png"
        string_val: "../data/Training/Run_0001/images/frame_00184.png"
        string_val: "../data/Training/Run_0001/images/frame_01550.png"
        string_val: "../data/Training/Run_0001/images/frame_01520.png"
        string_val: "../data/Training/Run_0001/images/frame_02333.png"
        string_val: "../data/Training/Run_0001/images/frame_03144.png"
        string_val: "../data/Training/Run_0001/images/frame_00668.png"
        string_val: "../data/Training/Run_0001/images/frame_01518.png"
        string_val: "../data/Training/Run_0001/images/frame_03296.png"
        string_val: "../data/Training/Run_0001/images/frame_03538.png"
        string_val: "../data/Training/Run_0001/images/frame_03575.png"
        string_val: "../data/Training/Run_0001/images/frame_01066.png"
        string_val: "../data/Training/Run_0001/images/frame_00467.png"
        string_val: "../data/Training/Run_0001/images/frame_02631.png"
        string_val: "../data/Training/Run_0001/images/frame_01677.png"
        string_val: "../data/Training/Run_0001/images/frame_04526.png"
        string_val: "../data/Training/Run_0001/images/frame_04404.png"
        string_val: "../data/Training/Run_0001/images/frame_03772.png"
        string_val: "../data/Training/Run_0001/images/frame_03390.png"
        string_val: "../data/Training/Run_0001/images/frame_01453.png"
        string_val: "../data/Training/Run_0001/images/frame_04386.png"
        string_val: "../data/Training/Run_0001/images/frame_03448.png"
        string_val: "../data/Training/Run_0001/images/frame_00489.png"
        string_val: "../data/Training/Run_0001/images/frame_03419.png"
        string_val: "../data/Training/Run_0001/images/frame_04377.png"
        string_val: "../data/Training/Run_0001/images/frame_02680.png"
        string_val: "../data/Training/Run_0001/images/frame_03224.png"
        string_val: "../data/Training/Run_0001/images/frame_03330.png"
        string_val: "../data/Training/Run_0001/images/frame_00700.png"
        string_val: "../data/Training/Run_0001/images/frame_00880.png"
        string_val: "../data/Training/Run_0001/images/frame_02133.png"
        string_val: "../data/Training/Run_0001/images/frame_03354.png"
        string_val: "../data/Training/Run_0001/images/frame_03491.png"
        string_val: "../data/Training/Run_0001/images/frame_03884.png"
        string_val: "../data/Training/Run_0001/images/frame_01992.png"
        string_val: "../data/Training/Run_0001/images/frame_01085.png"
        string_val: "../data/Training/Run_0001/images/frame_01708.png"
        string_val: "../data/Training/Run_0001/images/frame_00935.png"
        string_val: "../data/Training/Run_0001/images/frame_03986.png"
        string_val: "../data/Training/Run_0001/images/frame_01210.png"
        string_val: "../data/Training/Run_0001/images/frame_03486.png"
        string_val: "../data/Training/Run_0001/images/frame_02424.png"
        string_val: "../data/Training/Run_0001/images/frame_04191.png"
        string_val: "../data/Training/Run_0001/images/frame_00123.png"
        string_val: "../data/Training/Run_0001/images/frame_02255.png"
        string_val: "../data/Training/Run_0001/images/frame_03793.png"
        string_val: "../data/Training/Run_0001/images/frame_03151.png"
        string_val: "../data/Training/Run_0001/images/frame_03692.png"
        string_val: "../data/Training/Run_0001/images/frame_04356.png"
        string_val: "../data/Training/Run_0001/images/frame_01694.png"
        string_val: "../data/Training/Run_0001/images/frame_03177.png"
        string_val: "../data/Training/Run_0001/images/frame_01030.png"
        string_val: "../data/Training/Run_0001/images/frame_02416.png"
        string_val: "../data/Training/Run_0001/images/frame_01365.png"
        string_val: "../data/Training/Run_0001/images/frame_02469.png"
        string_val: "../data/Training/Run_0001/images/frame_01286.png"
        string_val: "../data/Training/Run_0001/images/frame_01767.png"
        string_val: "../data/Training/Run_0001/images/frame_00212.png"
        string_val: "../data/Training/Run_0001/images/frame_02264.png"
        string_val: "../data/Training/Run_0001/images/frame_04060.png"
        string_val: "../data/Training/Run_0001/images/frame_03461.png"
        string_val: "../data/Training/Run_0001/images/frame_03456.png"
        string_val: "../data/Training/Run_0001/images/frame_02862.png"
        string_val: "../data/Training/Run_0001/images/frame_02493.png"
        string_val: "../data/Training/Run_0001/images/frame_04101.png"
        string_val: "../data/Training/Run_0001/images/frame_04352.png"
        string_val: "../data/Training/Run_0001/images/frame_03145.png"
        string_val: "../data/Training/Run_0001/images/frame_00959.png"
        string_val: "../data/Training/Run_0001/images/frame_03659.png"
        string_val: "../data/Training/Run_0001/images/frame_01606.png"
        string_val: "../data/Training/Run_0001/images/frame_00894.png"
        string_val: "../data/Training/Run_0001/images/frame_00582.png"
        string_val: "../data/Training/Run_0001/images/frame_04635.png"
        string_val: "../data/Training/Run_0001/images/frame_03858.png"
        string_val: "../data/Training/Run_0001/images/frame_04131.png"
        string_val: "../data/Training/Run_0001/images/frame_04713.png"
        string_val: "../data/Training/Run_0001/images/frame_03916.png"
        string_val: "../data/Training/Run_0001/images/frame_03410.png"
        string_val: "../data/Training/Run_0001/images/frame_03714.png"
        string_val: "../data/Training/Run_0001/images/frame_02757.png"
        string_val: "../data/Training/Run_0001/images/frame_00026.png"
        string_val: "../data/Training/Run_0001/images/frame_03317.png"
        string_val: "../data/Training/Run_0001/images/frame_04543.png"
        string_val: "../data/Training/Run_0001/images/frame_03386.png"
        string_val: "../data/Training/Run_0001/images/frame_02841.png"
        string_val: "../data/Training/Run_0001/images/frame_01408.png"
        string_val: "../data/Training/Run_0001/images/frame_02694.png"
        string_val: "../data/Training/Run_0001/images/frame_01279.png"
        string_val: "../data/Training/Run_0001/images/frame_00809.png"
        string_val: "../data/Training/Run_0001/images/frame_03601.png"
        string_val: "../data/Training/Run_0001/images/frame_01805.png"
        string_val: "../data/Training/Run_0001/images/frame_00759.png"
        string_val: "../data/Training/Run_0001/images/frame_02322.png"
        string_val: "../data/Training/Run_0001/images/frame_01233.png"
        string_val: "../data/Training/Run_0001/images/frame_03082.png"
        string_val: "../data/Training/Run_0001/images/frame_02369.png"
        string_val: "../data/Training/Run_0001/images/frame_02808.png"
        string_val: "../data/Training/Run_0001/images/frame_01709.png"
        string_val: "../data/Training/Run_0001/images/frame_01564.png"
        string_val: "../data/Training/Run_0001/images/frame_02483.png"
        string_val: "../data/Training/Run_0001/images/frame_00924.png"
        string_val: "../data/Training/Run_0001/images/frame_03618.png"
        string_val: "../data/Training/Run_0001/images/frame_00203.png"
        string_val: "../data/Training/Run_0001/images/frame_00992.png"
        string_val: "../data/Training/Run_0001/images/frame_02605.png"
        string_val: "../data/Training/Run_0001/images/frame_03027.png"
        string_val: "../data/Training/Run_0001/images/frame_04530.png"
        string_val: "../data/Training/Run_0001/images/frame_00529.png"
        string_val: "../data/Training/Run_0001/images/frame_02869.png"
        string_val: "../data/Training/Run_0001/images/frame_00420.png"
        string_val: "../data/Training/Run_0001/images/frame_03935.png"
        string_val: "../data/Training/Run_0001/images/frame_00380.png"
        string_val: "../data/Training/Run_0001/images/frame_02014.png"
        string_val: "../data/Training/Run_0001/images/frame_00671.png"
        string_val: "../data/Training/Run_0001/images/frame_00943.png"
        string_val: "../data/Training/Run_0001/images/frame_01521.png"
        string_val: "../data/Training/Run_0001/images/frame_00588.png"
        string_val: "../data/Training/Run_0001/images/frame_04349.png"
        string_val: "../data/Training/Run_0001/images/frame_02921.png"
        string_val: "../data/Training/Run_0001/images/frame_02515.png"
        string_val: "../data/Training/Run_0001/images/frame_03684.png"
        string_val: "../data/Training/Run_0001/images/frame_03893.png"
        string_val: "../data/Training/Run_0001/images/frame_00832.png"
        string_val: "../data/Training/Run_0001/images/frame_00295.png"
        string_val: "../data/Training/Run_0001/images/frame_04679.png"
        string_val: "../data/Training/Run_0001/images/frame_01490.png"
        string_val: "../data/Training/Run_0001/images/frame_00308.png"
        string_val: "../data/Training/Run_0001/images/frame_02393.png"
        string_val: "../data/Training/Run_0001/images/frame_02568.png"
        string_val: "../data/Training/Run_0001/images/frame_02122.png"
        string_val: "../data/Training/Run_0001/images/frame_00526.png"
        string_val: "../data/Training/Run_0001/images/frame_03070.png"
        string_val: "../data/Training/Run_0001/images/frame_01189.png"
        string_val: "../data/Training/Run_0001/images/frame_00411.png"
        string_val: "../data/Training/Run_0001/images/frame_01284.png"
        string_val: "../data/Training/Run_0001/images/frame_02555.png"
        string_val: "../data/Training/Run_0001/images/frame_02254.png"
        string_val: "../data/Training/Run_0001/images/frame_00392.png"
        string_val: "../data/Training/Run_0001/images/frame_02528.png"
        string_val: "../data/Training/Run_0001/images/frame_01538.png"
        string_val: "../data/Training/Run_0001/images/frame_02301.png"
        string_val: "../data/Training/Run_0001/images/frame_02128.png"
        string_val: "../data/Training/Run_0001/images/frame_01936.png"
        string_val: "../data/Training/Run_0001/images/frame_02181.png"
        string_val: "../data/Training/Run_0001/images/frame_01256.png"
        string_val: "../data/Training/Run_0001/images/frame_04553.png"
        string_val: "../data/Training/Run_0001/images/frame_03878.png"
        string_val: "../data/Training/Run_0001/images/frame_01088.png"
        string_val: "../data/Training/Run_0001/images/frame_02457.png"
        string_val: "../data/Training/Run_0001/images/frame_04334.png"
        string_val: "../data/Training/Run_0001/images/frame_01316.png"
        string_val: "../data/Training/Run_0001/images/frame_02896.png"
        string_val: "../data/Training/Run_0001/images/frame_00298.png"
        string_val: "../data/Training/Run_0001/images/frame_04310.png"
        string_val: "../data/Training/Run_0001/images/frame_04057.png"
        string_val: "../data/Training/Run_0001/images/frame_01221.png"
        string_val: "../data/Training/Run_0001/images/frame_00156.png"
        string_val: "../data/Training/Run_0001/images/frame_01405.png"
        string_val: "../data/Training/Run_0001/images/frame_00814.png"
        string_val: "../data/Training/Run_0001/images/frame_02429.png"
        string_val: "../data/Training/Run_0001/images/frame_04609.png"
        string_val: "../data/Training/Run_0001/images/frame_03222.png"
        string_val: "../data/Training/Run_0001/images/frame_00250.png"
        string_val: "../data/Training/Run_0001/images/frame_00074.png"
        string_val: "../data/Training/Run_0001/images/frame_02937.png"
        string_val: "../data/Training/Run_0001/images/frame_04379.png"
        string_val: "../data/Training/Run_0001/images/frame_00436.png"
        string_val: "../data/Training/Run_0001/images/frame_02243.png"
        string_val: "../data/Training/Run_0001/images/frame_02059.png"
        string_val: "../data/Training/Run_0001/images/frame_03299.png"
        string_val: "../data/Training/Run_0001/images/frame_02982.png"
        string_val: "../data/Training/Run_0001/images/frame_03520.png"
        string_val: "../data/Training/Run_0001/images/frame_01037.png"
        string_val: "../data/Training/Run_0001/images/frame_03803.png"
        string_val: "../data/Training/Run_0001/images/frame_03861.png"
        string_val: "../data/Training/Run_0001/images/frame_02679.png"
        string_val: "../data/Training/Run_0001/images/frame_02068.png"
        string_val: "../data/Training/Run_0001/images/frame_00356.png"
        string_val: "../data/Training/Run_0001/images/frame_00725.png"
        string_val: "../data/Training/Run_0001/images/frame_04339.png"
        string_val: "../data/Training/Run_0001/images/frame_03436.png"
        string_val: "../data/Training/Run_0001/images/frame_02558.png"
        string_val: "../data/Training/Run_0001/images/frame_02196.png"
        string_val: "../data/Training/Run_0001/images/frame_00472.png"
        string_val: "../data/Training/Run_0001/images/frame_02146.png"
        string_val: "../data/Training/Run_0001/images/frame_01896.png"
        string_val: "../data/Training/Run_0001/images/frame_04138.png"
        string_val: "../data/Training/Run_0001/images/frame_02164.png"
        string_val: "../data/Training/Run_0001/images/frame_04415.png"
        string_val: "../data/Training/Run_0001/images/frame_03895.png"
        string_val: "../data/Training/Run_0001/images/frame_00354.png"
        string_val: "../data/Training/Run_0001/images/frame_03695.png"
        string_val: "../data/Training/Run_0001/images/frame_00260.png"
        string_val: "../data/Training/Run_0001/images/frame_02526.png"
        string_val: "../data/Training/Run_0001/images/frame_02274.png"
        string_val: "../data/Training/Run_0001/images/frame_00609.png"
        string_val: "../data/Training/Run_0001/images/frame_02988.png"
        string_val: "../data/Training/Run_0001/images/frame_00815.png"
        string_val: "../data/Training/Run_0001/images/frame_03394.png"
        string_val: "../data/Training/Run_0001/images/frame_04272.png"
        string_val: "../data/Training/Run_0001/images/frame_01151.png"
        string_val: "../data/Training/Run_0001/images/frame_01985.png"
        string_val: "../data/Training/Run_0001/images/frame_02446.png"
        string_val: "../data/Training/Run_0001/images/frame_04412.png"
        string_val: "../data/Training/Run_0001/images/frame_00973.png"
        string_val: "../data/Training/Run_0001/images/frame_04515.png"
        string_val: "../data/Training/Run_0001/images/frame_00580.png"
        string_val: "../data/Training/Run_0001/images/frame_01886.png"
        string_val: "../data/Training/Run_0001/images/frame_01200.png"
        string_val: "../data/Training/Run_0001/images/frame_00355.png"
        string_val: "../data/Training/Run_0001/images/frame_01347.png"
        string_val: "../data/Training/Run_0001/images/frame_01007.png"
        string_val: "../data/Training/Run_0001/images/frame_04567.png"
        string_val: "../data/Training/Run_0001/images/frame_00601.png"
        string_val: "../data/Training/Run_0001/images/frame_03476.png"
        string_val: "../data/Training/Run_0001/images/frame_00699.png"
        string_val: "../data/Training/Run_0001/images/frame_04661.png"
        string_val: "../data/Training/Run_0001/images/frame_01809.png"
        string_val: "../data/Training/Run_0001/images/frame_00798.png"
        string_val: "../data/Training/Run_0001/images/frame_03115.png"
        string_val: "../data/Training/Run_0001/images/frame_01766.png"
        string_val: "../data/Training/Run_0001/images/frame_03326.png"
        string_val: "../data/Training/Run_0001/images/frame_04106.png"
        string_val: "../data/Training/Run_0001/images/frame_01494.png"
        string_val: "../data/Training/Run_0001/images/frame_01358.png"
        string_val: "../data/Training/Run_0001/images/frame_01654.png"
        string_val: "../data/Training/Run_0001/images/frame_02073.png"
        string_val: "../data/Training/Run_0001/images/frame_01950.png"
        string_val: "../data/Training/Run_0001/images/frame_03069.png"
        string_val: "../data/Training/Run_0001/images/frame_02580.png"
        string_val: "../data/Training/Run_0001/images/frame_00569.png"
        string_val: "../data/Training/Run_0001/images/frame_01527.png"
        string_val: "../data/Training/Run_0001/images/frame_00979.png"
        string_val: "../data/Training/Run_0001/images/frame_01475.png"
        string_val: "../data/Training/Run_0001/images/frame_02784.png"
        string_val: "../data/Training/Run_0001/images/frame_03716.png"
        string_val: "../data/Training/Run_0001/images/frame_03504.png"
        string_val: "../data/Training/Run_0001/images/frame_03900.png"
        string_val: "../data/Training/Run_0001/images/frame_02233.png"
        string_val: "../data/Training/Run_0001/images/frame_00202.png"
        string_val: "../data/Training/Run_0001/images/frame_01338.png"
        string_val: "../data/Training/Run_0001/images/frame_01517.png"
        string_val: "../data/Training/Run_0001/images/frame_01961.png"
        string_val: "../data/Training/Run_0001/images/frame_03464.png"
        string_val: "../data/Training/Run_0001/images/frame_04436.png"
        string_val: "../data/Training/Run_0001/images/frame_03227.png"
        string_val: "../data/Training/Run_0001/images/frame_02067.png"
        string_val: "../data/Training/Run_0001/images/frame_02452.png"
        string_val: "../data/Training/Run_0001/images/frame_01402.png"
        string_val: "../data/Training/Run_0001/images/frame_01922.png"
        string_val: "../data/Training/Run_0001/images/frame_01214.png"
        string_val: "../data/Training/Run_0001/images/frame_00486.png"
        string_val: "../data/Training/Run_0001/images/frame_04699.png"
        string_val: "../data/Training/Run_0001/images/frame_02428.png"
        string_val: "../data/Training/Run_0001/images/frame_03818.png"
        string_val: "../data/Training/Run_0001/images/frame_01578.png"
        string_val: "../data/Training/Run_0001/images/frame_00413.png"
        string_val: "../data/Training/Run_0001/images/frame_00922.png"
        string_val: "../data/Training/Run_0001/images/frame_01737.png"
        string_val: "../data/Training/Run_0001/images/frame_03746.png"
        string_val: "../data/Training/Run_0001/images/frame_01980.png"
        string_val: "../data/Training/Run_0001/images/frame_01713.png"
        string_val: "../data/Training/Run_0001/images/frame_03959.png"
        string_val: "../data/Training/Run_0001/images/frame_00314.png"
        string_val: "../data/Training/Run_0001/images/frame_04516.png"
        string_val: "../data/Training/Run_0001/images/frame_00765.png"
        string_val: "../data/Training/Run_0001/images/frame_04040.png"
        string_val: "../data/Training/Run_0001/images/frame_01487.png"
        string_val: "../data/Training/Run_0001/images/frame_03428.png"
        string_val: "../data/Training/Run_0001/images/frame_01046.png"
        string_val: "../data/Training/Run_0001/images/frame_03978.png"
        string_val: "../data/Training/Run_0001/images/frame_03088.png"
        string_val: "../data/Training/Run_0001/images/frame_00397.png"
        string_val: "../data/Training/Run_0001/images/frame_04723.png"
        string_val: "../data/Training/Run_0001/images/frame_01472.png"
        string_val: "../data/Training/Run_0001/images/frame_00201.png"
        string_val: "../data/Training/Run_0001/images/frame_04074.png"
        string_val: "../data/Training/Run_0001/images/frame_03964.png"
        string_val: "../data/Training/Run_0001/images/frame_00793.png"
        string_val: "../data/Training/Run_0001/images/frame_01775.png"
        string_val: "../data/Training/Run_0001/images/frame_03648.png"
        string_val: "../data/Training/Run_0001/images/frame_01012.png"
        string_val: "../data/Training/Run_0001/images/frame_02083.png"
        string_val: "../data/Training/Run_0001/images/frame_02703.png"
        string_val: "../data/Training/Run_0001/images/frame_03192.png"
        string_val: "../data/Training/Run_0001/images/frame_01176.png"
        string_val: "../data/Training/Run_0001/images/frame_00015.png"
        string_val: "../data/Training/Run_0001/images/frame_01697.png"
        string_val: "../data/Training/Run_0001/images/frame_03248.png"
        string_val: "../data/Training/Run_0001/images/frame_02063.png"
        string_val: "../data/Training/Run_0001/images/frame_02399.png"
        string_val: "../data/Training/Run_0001/images/frame_00789.png"
        string_val: "../data/Training/Run_0001/images/frame_04249.png"
        string_val: "../data/Training/Run_0001/images/frame_01998.png"
        string_val: "../data/Training/Run_0001/images/frame_02507.png"
        string_val: "../data/Training/Run_0001/images/frame_00741.png"
        string_val: "../data/Training/Run_0001/images/frame_01272.png"
        string_val: "../data/Training/Run_0001/images/frame_04168.png"
        string_val: "../data/Training/Run_0001/images/frame_03093.png"
        string_val: "../data/Training/Run_0001/images/frame_02746.png"
        string_val: "../data/Training/Run_0001/images/frame_03527.png"
        string_val: "../data/Training/Run_0001/images/frame_00534.png"
        string_val: "../data/Training/Run_0001/images/frame_03550.png"
        string_val: "../data/Training/Run_0001/images/frame_00371.png"
        string_val: "../data/Training/Run_0001/images/frame_04519.png"
        string_val: "../data/Training/Run_0001/images/frame_00216.png"
        string_val: "../data/Training/Run_0001/images/frame_01053.png"
        string_val: "../data/Training/Run_0001/images/frame_01328.png"
        string_val: "../data/Training/Run_0001/images/frame_02681.png"
        string_val: "../data/Training/Run_0001/images/frame_01657.png"
        string_val: "../data/Training/Run_0001/images/frame_03017.png"
        string_val: "../data/Training/Run_0001/images/frame_02471.png"
        string_val: "../data/Training/Run_0001/images/frame_02990.png"
        string_val: "../data/Training/Run_0001/images/frame_01156.png"
        string_val: "../data/Training/Run_0001/images/frame_00928.png"
        string_val: "../data/Training/Run_0001/images/frame_00933.png"
        string_val: "../data/Training/Run_0001/images/frame_01544.png"
        string_val: "../data/Training/Run_0001/images/frame_04277.png"
        string_val: "../data/Training/Run_0001/images/frame_04705.png"
        string_val: "../data/Training/Run_0001/images/frame_02423.png"
        string_val: "../data/Training/Run_0001/images/frame_00179.png"
        string_val: "../data/Training/Run_0001/images/frame_02734.png"
        string_val: "../data/Training/Run_0001/images/frame_00459.png"
        string_val: "../data/Training/Run_0001/images/frame_00563.png"
        string_val: "../data/Training/Run_0001/images/frame_02898.png"
        string_val: "../data/Training/Run_0001/images/frame_04174.png"
        string_val: "../data/Training/Run_0001/images/frame_04038.png"
        string_val: "../data/Training/Run_0001/images/frame_02538.png"
        string_val: "../data/Training/Run_0001/images/frame_00077.png"
        string_val: "../data/Training/Run_0001/images/frame_01178.png"
        string_val: "../data/Training/Run_0001/images/frame_04235.png"
        string_val: "../data/Training/Run_0001/images/frame_04401.png"
        string_val: "../data/Training/Run_0001/images/frame_04456.png"
        string_val: "../data/Training/Run_0001/images/frame_00906.png"
        string_val: "../data/Training/Run_0001/images/frame_02886.png"
        string_val: "../data/Training/Run_0001/images/frame_01729.png"
        string_val: "../data/Training/Run_0001/images/frame_03418.png"
        string_val: "../data/Training/Run_0001/images/frame_03686.png"
        string_val: "../data/Training/Run_0001/images/frame_01248.png"
        string_val: "../data/Training/Run_0001/images/frame_00860.png"
        string_val: "../data/Training/Run_0001/images/frame_04048.png"
        string_val: "../data/Training/Run_0001/images/frame_02630.png"
        string_val: "../data/Training/Run_0001/images/frame_03245.png"
        string_val: "../data/Training/Run_0001/images/frame_02458.png"
        string_val: "../data/Training/Run_0001/images/frame_02028.png"
        string_val: "../data/Training/Run_0001/images/frame_02923.png"
        string_val: "../data/Training/Run_0001/images/frame_03644.png"
        string_val: "../data/Training/Run_0001/images/frame_04675.png"
        string_val: "../data/Training/Run_0001/images/frame_03269.png"
        string_val: "../data/Training/Run_0001/images/frame_04611.png"
        string_val: "../data/Training/Run_0001/images/frame_04157.png"
        string_val: "../data/Training/Run_0001/images/frame_00757.png"
        string_val: "../data/Training/Run_0001/images/frame_01413.png"
        string_val: "../data/Training/Run_0001/images/frame_02437.png"
        string_val: "../data/Training/Run_0001/images/frame_03275.png"
        string_val: "../data/Training/Run_0001/images/frame_04325.png"
        string_val: "../data/Training/Run_0001/images/frame_01744.png"
        string_val: "../data/Training/Run_0001/images/frame_04190.png"
        string_val: "../data/Training/Run_0001/images/frame_00445.png"
        string_val: "../data/Training/Run_0001/images/frame_00719.png"
        string_val: "../data/Training/Run_0001/images/frame_04636.png"
        string_val: "../data/Training/Run_0001/images/frame_00175.png"
        string_val: "../data/Training/Run_0001/images/frame_04067.png"
        string_val: "../data/Training/Run_0001/images/frame_04344.png"
        string_val: "../data/Training/Run_0001/images/frame_00360.png"
        string_val: "../data/Training/Run_0001/images/frame_01660.png"
        string_val: "../data/Training/Run_0001/images/frame_00521.png"
        string_val: "../data/Training/Run_0001/images/frame_02381.png"
        string_val: "../data/Training/Run_0001/images/frame_00451.png"
        string_val: "../data/Training/Run_0001/images/frame_01070.png"
        string_val: "../data/Training/Run_0001/images/frame_02539.png"
        string_val: "../data/Training/Run_0001/images/frame_03722.png"
        string_val: "../data/Training/Run_0001/images/frame_00362.png"
        string_val: "../data/Training/Run_0001/images/frame_03019.png"
        string_val: "../data/Training/Run_0001/images/frame_02597.png"
        string_val: "../data/Training/Run_0001/images/frame_02807.png"
        string_val: "../data/Training/Run_0001/images/frame_02600.png"
        string_val: "../data/Training/Run_0001/images/frame_01240.png"
        string_val: "../data/Training/Run_0001/images/frame_03465.png"
        string_val: "../data/Training/Run_0001/images/frame_01383.png"
        string_val: "../data/Training/Run_0001/images/frame_01722.png"
        string_val: "../data/Training/Run_0001/images/frame_01420.png"
        string_val: "../data/Training/Run_0001/images/frame_01587.png"
        string_val: "../data/Training/Run_0001/images/frame_01895.png"
        string_val: "../data/Training/Run_0001/images/frame_02546.png"
        string_val: "../data/Training/Run_0001/images/frame_03226.png"
        string_val: "../data/Training/Run_0001/images/frame_03111.png"
        string_val: "../data/Training/Run_0001/images/frame_03633.png"
        string_val: "../data/Training/Run_0001/images/frame_03931.png"
        string_val: "../data/Training/Run_0001/images/frame_01893.png"
        string_val: "../data/Training/Run_0001/images/frame_01921.png"
        string_val: "../data/Training/Run_0001/images/frame_02197.png"
        string_val: "../data/Training/Run_0001/images/frame_00133.png"
        string_val: "../data/Training/Run_0001/images/frame_03442.png"
        string_val: "../data/Training/Run_0001/images/frame_02415.png"
        string_val: "../data/Training/Run_0001/images/frame_03393.png"
        string_val: "../data/Training/Run_0001/images/frame_04561.png"
        string_val: "../data/Training/Run_0001/images/frame_02997.png"
        string_val: "../data/Training/Run_0001/images/frame_04361.png"
        string_val: "../data/Training/Run_0001/images/frame_00485.png"
        string_val: "../data/Training/Run_0001/images/frame_00989.png"
        string_val: "../data/Training/Run_0001/images/frame_03452.png"
        string_val: "../data/Training/Run_0001/images/frame_04330.png"
        string_val: "../data/Training/Run_0001/images/frame_00669.png"
        string_val: "../data/Training/Run_0001/images/frame_02368.png"
        string_val: "../data/Training/Run_0001/images/frame_02553.png"
        string_val: "../data/Training/Run_0001/images/frame_03013.png"
        string_val: "../data/Training/Run_0001/images/frame_00422.png"
        string_val: "../data/Training/Run_0001/images/frame_02730.png"
        string_val: "../data/Training/Run_0001/images/frame_01302.png"
        string_val: "../data/Training/Run_0001/images/frame_03193.png"
        string_val: "../data/Training/Run_0001/images/frame_00790.png"
        string_val: "../data/Training/Run_0001/images/frame_03753.png"
        string_val: "../data/Training/Run_0001/images/frame_03540.png"
        string_val: "../data/Training/Run_0001/images/frame_04492.png"
        string_val: "../data/Training/Run_0001/images/frame_02187.png"
        string_val: "../data/Training/Run_0001/images/frame_04237.png"
        string_val: "../data/Training/Run_0001/images/frame_01926.png"
        string_val: "../data/Training/Run_0001/images/frame_01471.png"
        string_val: "../data/Training/Run_0001/images/frame_01342.png"
        string_val: "../data/Training/Run_0001/images/frame_02775.png"
        string_val: "../data/Training/Run_0001/images/frame_03897.png"
        string_val: "../data/Training/Run_0001/images/frame_02566.png"
        string_val: "../data/Training/Run_0001/images/frame_03806.png"
        string_val: "../data/Training/Run_0001/images/frame_01894.png"
        string_val: "../data/Training/Run_0001/images/frame_01191.png"
        string_val: "../data/Training/Run_0001/images/frame_04593.png"
        string_val: "../data/Training/Run_0001/images/frame_02842.png"
        string_val: "../data/Training/Run_0001/images/frame_02854.png"
        string_val: "../data/Training/Run_0001/images/frame_00766.png"
        string_val: "../data/Training/Run_0001/images/frame_01983.png"
        string_val: "../data/Training/Run_0001/images/frame_03967.png"
        string_val: "../data/Training/Run_0001/images/frame_03006.png"
        string_val: "../data/Training/Run_0001/images/frame_03077.png"
        string_val: "../data/Training/Run_0001/images/frame_04551.png"
        string_val: "../data/Training/Run_0001/images/frame_02752.png"
        string_val: "../data/Training/Run_0001/images/frame_02652.png"
        string_val: "../data/Training/Run_0001/images/frame_01692.png"
        string_val: "../data/Training/Run_0001/images/frame_00622.png"
        string_val: "../data/Training/Run_0001/images/frame_00672.png"
        string_val: "../data/Training/Run_0001/images/frame_01398.png"
        string_val: "../data/Training/Run_0001/images/frame_00873.png"
        string_val: "../data/Training/Run_0001/images/frame_02124.png"
        string_val: "../data/Training/Run_0001/images/frame_03402.png"
        string_val: "../data/Training/Run_0001/images/frame_04420.png"
        string_val: "../data/Training/Run_0001/images/frame_03483.png"
        string_val: "../data/Training/Run_0001/images/frame_01169.png"
        string_val: "../data/Training/Run_0001/images/frame_00513.png"
        string_val: "../data/Training/Run_0001/images/frame_04056.png"
        string_val: "../data/Training/Run_0001/images/frame_04396.png"
        string_val: "../data/Training/Run_0001/images/frame_01350.png"
        string_val: "../data/Training/Run_0001/images/frame_00870.png"
        string_val: "../data/Training/Run_0001/images/frame_00441.png"
        string_val: "../data/Training/Run_0001/images/frame_00127.png"
        string_val: "../data/Training/Run_0001/images/frame_02071.png"
        string_val: "../data/Training/Run_0001/images/frame_02722.png"
        string_val: "../data/Training/Run_0001/images/frame_00386.png"
        string_val: "../data/Training/Run_0001/images/frame_00275.png"
        string_val: "../data/Training/Run_0001/images/frame_01361.png"
        string_val: "../data/Training/Run_0001/images/frame_00642.png"
        string_val: "../data/Training/Run_0001/images/frame_01909.png"
        string_val: "../data/Training/Run_0001/images/frame_00137.png"
        string_val: "../data/Training/Run_0001/images/frame_00357.png"
        string_val: "../data/Training/Run_0001/images/frame_03790.png"
        string_val: "../data/Training/Run_0001/images/frame_01310.png"
        string_val: "../data/Training/Run_0001/images/frame_01551.png"
        string_val: "../data/Training/Run_0001/images/frame_03647.png"
        string_val: "../data/Training/Run_0001/images/frame_01760.png"
        string_val: "../data/Training/Run_0001/images/frame_04424.png"
        string_val: "../data/Training/Run_0001/images/frame_02852.png"
        string_val: "../data/Training/Run_0001/images/frame_03610.png"
        string_val: "../data/Training/Run_0001/images/frame_02640.png"
        string_val: "../data/Training/Run_0001/images/frame_04545.png"
        string_val: "../data/Training/Run_0001/images/frame_00512.png"
        string_val: "../data/Training/Run_0001/images/frame_04020.png"
        string_val: "../data/Training/Run_0001/images/frame_03067.png"
        string_val: "../data/Training/Run_0001/images/frame_00750.png"
        string_val: "../data/Training/Run_0001/images/frame_01707.png"
        string_val: "../data/Training/Run_0001/images/frame_04073.png"
        string_val: "../data/Training/Run_0001/images/frame_00779.png"
        string_val: "../data/Training/Run_0001/images/frame_00153.png"
        string_val: "../data/Training/Run_0001/images/frame_00410.png"
        string_val: "../data/Training/Run_0001/images/frame_00925.png"
        string_val: "../data/Training/Run_0001/images/frame_00632.png"
        string_val: "../data/Training/Run_0001/images/frame_00192.png"
        string_val: "../data/Training/Run_0001/images/frame_02861.png"
        string_val: "../data/Training/Run_0001/images/frame_01426.png"
        string_val: "../data/Training/Run_0001/images/frame_04322.png"
        string_val: "../data/Training/Run_0001/images/frame_02477.png"
        string_val: "../data/Training/Run_0001/images/frame_04428.png"
        string_val: "../data/Training/Run_0001/images/frame_03446.png"
        string_val: "../data/Training/Run_0001/images/frame_00655.png"
        string_val: "../data/Training/Run_0001/images/frame_00891.png"
        string_val: "../data/Training/Run_0001/images/frame_00010.png"
        string_val: "../data/Training/Run_0001/images/frame_01329.png"
        string_val: "../data/Training/Run_0001/images/frame_00288.png"
        string_val: "../data/Training/Run_0001/images/frame_02210.png"
        string_val: "../data/Training/Run_0001/images/frame_00301.png"
        string_val: "../data/Training/Run_0001/images/frame_03662.png"
        string_val: "../data/Training/Run_0001/images/frame_02855.png"
        string_val: "../data/Training/Run_0001/images/frame_00211.png"
        string_val: "../data/Training/Run_0001/images/frame_02544.png"
        string_val: "../data/Training/Run_0001/images/frame_00555.png"
        string_val: "../data/Training/Run_0001/images/frame_00157.png"
        string_val: "../data/Training/Run_0001/images/frame_01636.png"
        string_val: "../data/Training/Run_0001/images/frame_00025.png"
        string_val: "../data/Training/Run_0001/images/frame_03315.png"
        string_val: "../data/Training/Run_0001/images/frame_02910.png"
        string_val: "../data/Training/Run_0001/images/frame_03694.png"
        string_val: "../data/Training/Run_0001/images/frame_04626.png"
        string_val: "../data/Training/Run_0001/images/frame_01252.png"
        string_val: "../data/Training/Run_0001/images/frame_00488.png"
        string_val: "../data/Training/Run_0001/images/frame_04146.png"
        string_val: "../data/Training/Run_0001/images/frame_03899.png"
        string_val: "../data/Training/Run_0001/images/frame_00095.png"
        string_val: "../data/Training/Run_0001/images/frame_03953.png"
        string_val: "../data/Training/Run_0001/images/frame_01993.png"
        string_val: "../data/Training/Run_0001/images/frame_03745.png"
        string_val: "../data/Training/Run_0001/images/frame_00952.png"
        string_val: "../data/Training/Run_0001/images/frame_03972.png"
        string_val: "../data/Training/Run_0001/images/frame_04117.png"
        string_val: "../data/Training/Run_0001/images/frame_03334.png"
        string_val: "../data/Training/Run_0001/images/frame_00499.png"
        string_val: "../data/Training/Run_0001/images/frame_03938.png"
        string_val: "../data/Training/Run_0001/images/frame_04614.png"
        string_val: "../data/Training/Run_0001/images/frame_01888.png"
        string_val: "../data/Training/Run_0001/images/frame_00697.png"
        string_val: "../data/Training/Run_0001/images/frame_04608.png"
        string_val: "../data/Training/Run_0001/images/frame_00532.png"
        string_val: "../data/Training/Run_0001/images/frame_01680.png"
        string_val: "../data/Training/Run_0001/images/frame_03707.png"
        string_val: "../data/Training/Run_0001/images/frame_00875.png"
        string_val: "../data/Training/Run_0001/images/frame_00673.png"
        string_val: "../data/Training/Run_0001/images/frame_02991.png"
        string_val: "../data/Training/Run_0001/images/frame_03050.png"
        string_val: "../data/Training/Run_0001/images/frame_00777.png"
        string_val: "../data/Training/Run_0001/images/frame_00165.png"
        string_val: "../data/Training/Run_0001/images/frame_02736.png"
        string_val: "../data/Training/Run_0001/images/frame_00963.png"
        string_val: "../data/Training/Run_0001/images/frame_01274.png"
        string_val: "../data/Training/Run_0001/images/frame_01949.png"
        string_val: "../data/Training/Run_0001/images/frame_03679.png"
        string_val: "../data/Training/Run_0001/images/frame_03194.png"
        string_val: "../data/Training/Run_0001/images/frame_00525.png"
        string_val: "../data/Training/Run_0001/images/frame_03497.png"
        string_val: "../data/Training/Run_0001/images/frame_03062.png"
        string_val: "../data/Training/Run_0001/images/frame_04696.png"
        string_val: "../data/Training/Run_0001/images/frame_03176.png"
        string_val: "../data/Training/Run_0001/images/frame_04370.png"
        string_val: "../data/Training/Run_0001/images/frame_00147.png"
        string_val: "../data/Training/Run_0001/images/frame_03581.png"
        string_val: "../data/Training/Run_0001/images/frame_00271.png"
        string_val: "../data/Training/Run_0001/images/frame_02593.png"
        string_val: "../data/Training/Run_0001/images/frame_00453.png"
        string_val: "../data/Training/Run_0001/images/frame_03588.png"
        string_val: "../data/Training/Run_0001/images/frame_01780.png"
        string_val: "../data/Training/Run_0001/images/frame_04219.png"
        string_val: "../data/Training/Run_0001/images/frame_00331.png"
        string_val: "../data/Training/Run_0001/images/frame_03881.png"
        string_val: "../data/Training/Run_0001/images/frame_00786.png"
        string_val: "../data/Training/Run_0001/images/frame_01739.png"
        string_val: "../data/Training/Run_0001/images/frame_03656.png"
        string_val: "../data/Training/Run_0001/images/frame_00907.png"
        string_val: "../data/Training/Run_0001/images/frame_00345.png"
        string_val: "../data/Training/Run_0001/images/frame_01832.png"
        string_val: "../data/Training/Run_0001/images/frame_04508.png"
        string_val: "../data/Training/Run_0001/images/frame_01360.png"
        string_val: "../data/Training/Run_0001/images/frame_01462.png"
        string_val: "../data/Training/Run_0001/images/frame_04678.png"
        string_val: "../data/Training/Run_0001/images/frame_04244.png"
        string_val: "../data/Training/Run_0001/images/frame_03726.png"
        string_val: "../data/Training/Run_0001/images/frame_03268.png"
        string_val: "../data/Training/Run_0001/images/frame_00902.png"
        string_val: "../data/Training/Run_0001/images/frame_00247.png"
        string_val: "../data/Training/Run_0001/images/frame_00395.png"
        string_val: "../data/Training/Run_0001/images/frame_02625.png"
        string_val: "../data/Training/Run_0001/images/frame_03104.png"
        string_val: "../data/Training/Run_0001/images/frame_03969.png"
        string_val: "../data/Training/Run_0001/images/frame_02710.png"
        string_val: "../data/Training/Run_0001/images/frame_02288.png"
        string_val: "../data/Training/Run_0001/images/frame_00586.png"
        string_val: "../data/Training/Run_0001/images/frame_00634.png"
        string_val: "../data/Training/Run_0001/images/frame_03361.png"
        string_val: "../data/Training/Run_0001/images/frame_00723.png"
        string_val: "../data/Training/Run_0001/images/frame_01052.png"
        string_val: "../data/Training/Run_0001/images/frame_03700.png"
        string_val: "../data/Training/Run_0001/images/frame_03381.png"
        string_val: "../data/Training/Run_0001/images/frame_00823.png"
        string_val: "../data/Training/Run_0001/images/frame_01561.png"
        string_val: "../data/Training/Run_0001/images/frame_02349.png"
        string_val: "../data/Training/Run_0001/images/frame_00043.png"
        string_val: "../data/Training/Run_0001/images/frame_02309.png"
        string_val: "../data/Training/Run_0001/images/frame_01970.png"
        string_val: "../data/Training/Run_0001/images/frame_02809.png"
        string_val: "../data/Training/Run_0001/images/frame_02502.png"
        string_val: "../data/Training/Run_0001/images/frame_00072.png"
        string_val: "../data/Training/Run_0001/images/frame_00478.png"
        string_val: "../data/Training/Run_0001/images/frame_02510.png"
